{"calls":[{"body":"sitedata/cfp.md","bodytext":"### **Call For papers: 17th International  Natural Language Generation Conference (INLG 2024*)*\n\nWe invite the submission of long and short papers, as well as system demonstrations, related to all aspects of Natural Language Generation (NLG), including data-to-text, concept-to-text, text-to-text and vision-to-text approaches. Accepted papers will be presented as oral talks or posters.\n\nThe event is organized under the auspices of the Special Interest Group on Natural Language Generation ([SIGGEN](https://aclweb.org/aclwiki/SIGGEN)) of the Association for Computational Linguistics ([ACL](https://aclweb.org/)). The event will be held from 11-15 September in Tokyo, Japan, Czech Republic. INLG 2024 will be (jointly) colocated with [SIGDial 2024](https://2024.sigdial.org/).\n\n\n### **Important dates**\n\nAll deadlines are Anywhere on Earth (UTC-12)\n\n\n\n* ***UPDATE: START system regular paper title & abstract submission deadline: May 22, 2024***\n* ***UPDATE: START system full paper submission deadline: May 29, 2024***\n* ***UPDATE: ARR commitment to INLG deadline via START system: June 19, 2024***\n* START system demo paper submission deadline: June 15, 2024\n* Notification: July 11, 2024\n* Camera ready: July 25, 2024\n* Conference: 11-15 September 2024\n\n### **Submission website**\nYou can make your submissions to INLG 2024 [here](https://softconf.com/n/inlg2024/).\n\n### **Topics**\n\nINLG 2024 solicits papers on any topic related to NLG. General topics of interest include, but are not limited to:\n\n\n\n* Affect/emotion generation\n* Analysis and detection of automatically generated text\n* Bias and fairness in NLG systems\n* Cognitive modelling of language production\n* Computational efficiency of NLG models\n* Content and text planning\n* Corpora and resources for NLG\n* Ethical considerations of NLG\n* Evaluation and error analysis of NLG systems\n* Explainability and Trustworthiness of NLG systems\n* Generalizability of NLG systems\n* Grounded language generation\n* Large Language Models for NLG\n* Lexicalisation\n* Multimedia and multimodality in generation\n* Natural language understanding techniques for NLG\n* NLG and accessibility\n* NLG in speech synthesis and spoken language models\n* NLG in dialogue\n* NLG for human-robot interaction\n* NLG for low-resourced languages\n* NLG for real-world applications\n* Paraphrasing, summarization and translation\n* Personalisation and variation in text\n* Referring expression generation\n* Storytelling and narrative generation\n* Surface realisation\n* System architectures\n\n\n### Submissions & Format\n\nThree kinds of papers can be submitted:\n\n\n\n* <span style=\"text-decoration:underline;\">Long papers</span> are most appropriate for presenting substantial research results and must not exceed eight (8) pages of content, plus unlimited pages of ethical considerations, supplementary material statements, and references. The supplementary material statement provides detailed descriptions to support the reproduction of the results presented in the paper (see below for details). The final versions of long papers will be given one additional page of content (up to 9 pages) so that reviewers' comments can be taken into account.\n* <span style=\"text-decoration:underline;\">Short papers</span> are more appropriate for presenting an ongoing research effort and must not exceed four (4) pages, plus unlimited pages of ethical considerations, supplementary material statements, and references. The final versions of short papers will be given one additional page of content (up to 5 pages) so that reviewers' comments can be taken into account.\n* <span style=\"text-decoration:underline;\">Demo papers</span> should be no more than two (2) pages, including references, and should describe implemented systems relevant to the NLG community. It also should include a link to a short screencast of the working software. In addition, authors of demo papers must be willing to present a demo of their system during INLG 2024.\n\nSubmissions should follow [ACL Author Guidelines](https://www.aclweb.org/adminwiki/index.php?title=ACL_Author_Guidelines) and policies for submission, review and citation, and be anonymised for double blind reviewing. Please use ACL 2024 style files; LaTeX style files and Microsoft Word templates are available at[ https://2024.aclweb.org/calls/style_and_formatting/](https://2024.aclweb.org/calls/style_and_formatting/).\n\nAuthors must honour the ethical code set out in the [ACL Code of Ethics](https://www.aclweb.org/portal/content/acl-code-ethics). If your work raises any ethical issues, you should include an explicit discussion of those issues. This will also be taken into account in the review process. You may find [this checklist](https://aclrollingreview.org/responsibleNLPresearch/) of use.\n\nAuthors are strongly encouraged to ensure that their work is reproducible; see, e.g., the following [reproducibility checklist](https://2021.aclweb.org/calls/reproducibility-checklist/). Papers involving any kind of experimental results (human judgments, system outputs, etc) should incorporate a data availability statement into their paper. Authors are asked to indicate whether the data is made publicly available. If the data is not made available, authors should provide a brief explanation why. (E.g. because the data contains proprietary information.) A [statement guide](https://inlg2024.github.io/resource_statement.html) is available on the INLG 2024 website.\n\nTo submit a long or short paper to INLG 2024, authors can either submit directly or commit a paper previously reviewed by ARR via the same [paper submission site](https://softconf.com/n/inlg2024/). For direct submissions, the deadline for submitting abstracts and titles of papers is May 22, 2024, 11:59:59 PM AOE and the full paper submission deadline is May 29, 2024, 11:59:59 PM AOE. If committing an ARR paper to INLG, the submission is also made through the INLG 2024 paper submission site, indicating the link of the paper on OpenReview. The deadline for committing an ARR paper to INLG is June 19, 2024, 11:59:59 PM AOE, and the last eligible ARR paper submission deadline for INLG 2024 is April 15, 2024. It is important to note that when committing an ARR paper to INLG, it should be submitted through the INLG 2024 paper submission site, just like a direct submission paper, with the only difference being the need to provide the OpenReview link to the paper and to provide an optional author response to reviews.\n\nDemo papers should be submitted directly through the INLG 2024 [paper submission site](https://softconf.com/n/inlg2024/) by June 15, 2024, 11:59:59 PM AOE.\n\nAll accepted papers will be published in the INLG 2024 proceedings and included in the ACL anthology. A paper accepted for presentation at INLG 2024 must not have been presented at any other meeting with publicly available proceedings. Dual submission to other conferences is permitted, provided that authors clearly indicate this in the submission form. If the paper is accepted at both venues, the authors will need to choose which venue to present at, since they can not present the same paper twice.\n\n\n### **Awards**\n\nINLG 2024 will present several awards to recognize outstanding achievements in the field. These awards are:\n\n\n\n* Best Long Paper Award: This award will be given to the best long paper submission based on its originality, impact, and contribution to the field of NLG.\n* Best Short Paper Award: This award will be given to the best short paper submission based on its originality, impact, and contribution to the field of NLG.\n* Best Demo Paper Award: This award will recognize the best demo paper submitted to the conference. This award considers not only the paper's quality but also the demonstration given at the conference. The demonstration will play a significant role in the judging process.\n* Best Evaluation Award: The award is a new addition to INLG 2024. This award is designed to honour authors who have demonstrated the most comprehensive and insightful analysis in evaluating their results. This award aims to highlight papers where the authors have gone the extra mile in providing a thorough and detailed analysis of their results, offering a nuanced understanding of their findings.\n\nFrequently asked questions about committing a paper from ACL Rolling Review are answered in the [Help](https://inlg2024.github.io/help.html) tab.\n","deadline":"May 22, 2024 11:59:59 PM AOE","id":1,"title":"INLG 2024 Call for Papers"},{"body":"sitedata/call_for_workshops.md","bodytext":"## SIGDIAL&INLG Call for Workshops\n\nThe 24th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDial 2024) and the 17th International Natural Language Generation Conference (INLG 2024) will be held jointly in Tokyo, Japan on September 11-15, 2022. We now welcome the submission of workshop and tutorial proposals, which will take place on September 11 and 12 before the main conference.\n\nWe encourage submissions of proposals on any topic of interest to the discourse, dialogue, and natural language generation communities. This program is intended to offer new perspectives and bring together researchers working on related topics. We especially encourage the sessions that would bring together researchers from SIGDial and INLG communities.\n\nTopics of interest include all aspects related to Dialogue, Discourse and Generation including (but not limited to) annotation and resources, evaluation, large language models, adversarial and RL methods, explainable/ethical AI, summarization, interactive/multimodal/situated/incremental systems, data/knowledge/vision-to-text, and applications of dialogue and NLG.\n\nThe proposed workshops/tutorials may include a poster session, a panel session, an oral presentation session, a hackathon, a generation/dialogue challenge, or a combination of the above. Workshop organizers will be responsible for soliciting, reviewing, and selecting papers or abstracts. The workshop papers will be published in a separate proceedings. Workshops may, at the discretion of the SIGDial/INLG organizers, be held as parallel sessions.\n\n### Submissions\n\nWorkshop and Tutorial proposals should be 2-4 pages containing: title, type (workshop or tutorial), a summary of the topic, motivating theoretical interest and/or application context, a list of organizers and sponsors, duration (half-day or full-day), and a requested session format(s): poster/panel/oral/hackathon session, the number of expected attendees. The workshop proposals will be reviewed jointly by the general chair and program co-chairs.\n\n### Links\n\nThose wishing to propose a workshop or tutorial may want to look at some of the sessions organized at recent SIGDial meetings:\n\n- [Natural Language in Human Robot Interaction (NLiHRI 2022)](https://2022.sigdial.org/call-for-papers-nlihri/)\n- [NLG4health 2022](https://nlg4health.uvt.nl/)\n- [SummDial 2021](https://elitr.github.io/automatic-minuting/summdial.html)\n- [SafeConvAI 2021](https://sites.google.com/view/safety4convai/home)\n- [RoboDIAL 2022](https://robodial.github.io/)\n- [BigScience Workshop: LLMs 2021](https://bigscience.huggingface.co/)\n- [Interactive Natural Language Technology for Explainable Artificial Intelligence 2019](https://sites.google.com/view/nl4xai2019/)\n- [https://www.inlg2019.com/workshop](https://www.inlg2019.com/workshop)\n- [https://www.sigdial.org/files/workshops/conference18/sessions.htm](https://www.sigdial.org/files/workshops/conference18/sessions.htm)\n- [https://inlg2018.uvt.nl/workshops/](https://inlg2018.uvt.nl/workshops/)\n\n### Important Dates\n\nMar 24, 2024: Workshop/Tutorial Proposal Submission Deadline\n\nApril 14, 2024: Workshops/Tutorials Notifications\n\n### Submission\nThe proposals should be sent to conference(a)sigdial.org.\n","deadline":"March 24, 2024 11:59:59 PM AOE","id":2,"title":"Call for Workshop Proposals"},{"body":"sitedata/genchal.md","bodytext":"### **Call for new Shared Task proposals**\n\nWe invite submissions of papers describing ideas for future shared tasks in the general area of language generation (Generation Challenges 2024). Proposed tasks can be in the area of core NLG, or in other research areas in which language is generated. Examples include, but are not limited to: data-to-text NLG, text-to-text generation (including MT and summarisation), combining core NLG and MT, combining core NLG and text summarisation, NLG quality estimation, NLG evaluation metrics, and/or generating language from heterogeneous data, including image and video.\n\nThe Generation Challenges (GenChal) are an umbrella event designed to bring together a variety of shared-task efforts that involve the generation of natural language. This year, Generation Challenges will be held during a special session at the 17th International Conference on Natural Language Generation ([INLG 2024](https://inlg2024.github.io/index.html)), scheduled on September 11-15 2024. The session will follow the format of previous GenChal results sessions, with presentations of results by the organisers of the generation challenges that are currently running, a poster session for task participants to present their submissions, as well as presentations of proposals for new shared tasks in the Task Proposals Track, and discussion sessions. You can see the previous GenChal tasks on the [dedicated repository](https://sites.google.com/view/genchalrepository/home).\n\nSubmissions should describe possible future tasks in detail, including information regarding organisers, task description, motivating theoretical interest and/or application context, size and state of completion of data to be used, schedule and evaluation plans. Accepted shared tasks will be run in the 2024 iteration of INLG.\n\n\n### **Important dates**\n\n* **EDIT!** Submission deadline: June 11th 2024\n* Notification: July 11th 2024\n* Camera-ready submission: July 25th 2024\n* INLG conference: September 11th-15th 2024\n\nAll deadlines are 11.59 pm UTC -12h (\"anywhere on Earth\").\n\n### Submissions & Format\nSubmissions in the Shared Task Proposals track should be no more than 4 (four) pages long excluding citations, and should follow the [ACLPUB formatting guidelines](https://acl-org.github.io/ACLPUB/formatting.html) and [template files](https://2021.aclweb.org/downloads/acl-ijcnlp2021-templates.zip).\n\nProposals should be uploaded to the [SoftConf](https://softconf.com/n/inlg2024/user/scmd.cgi?scmd=submitPaperCustom&pageid=11) GenChal submission page, using the Submission type New shared task proposal.\n\nSubmissions will be peer-reviewed by the program committee. As reviewing will not be blind, there is no need to anonymise papers.\n\nThis is not intended to be a selective process, since the aim is to discuss new potential shared tasks with INLG delegates. However, the organisers reserve the right to reject proposals which do not fall within the scope of the GenChal initiative, or which do not follow guidelines. Accepted submissions will be published in separate GenChal 2024 proceedings on the ACL Anthology, [as was done in 2022](https://aclanthology.org/volumes/2022.inlg-genchal/).\n","deadline":"June 11, 2024 11:59:59 PM AOE","id":3,"title":"Call for new Shared Task proposals (GenChal)"}]}
